src/DataProcessors/БФТ_ВыгрузкаКонфигурации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<DataProcessor>
		<Properties>
			<Name>БФТ_ВыгрузкаКонфигурации</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПользовательХранилища</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПарольХранилища</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьКХранилищу</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТолькоВыгрузить</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерРевизии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВременныйПользовательХранилища</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгружатьФайлы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПользовательJIRA</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПарольJIRA</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>URL_JIRA</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Cookie</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/DataProcessors/БФТ_ВыгрузкаКонфигурации/Ext/ObjectModule.bsl
/////////////// Защита модуля ///////////////
// @protect                                //
/////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Функция - Выгрузить конфигурацию в файлы.
//
// Параметры:
//  НомерРевизии					 - Строка - Номер ревизии.
//  КаталогСохраненияФайлов			 - Строка - Каталог сохранения файлов.
//  АдресХранилищаРезультата		 - УникальныйИдентификатор - адрес временного хранилища с результатом.
//  ВыгружатьФайлы					 - Булево - Выгружать файлы.
//  ВыгружатьЗащищеннуюКонфигурацию	 - Булево - Выгружать защищенную конфигурацию.
//  ПутьКОбфускатору				 - Строка - Путь к обфускатору.
// 
// Возвращаемое значение:
//  ФоновоеЗадание - фоновое задание.
//
Функция ВыгрузитьКонфигурациюВФайлы(НомерРевизии, КаталогСохраненияФайлов, АдресХранилищаРезультата = Неопределено, ВыгружатьФайлы = Истина, ВыгружатьЗащищеннуюКонфигурацию, ПутьКОбфускатору) Экспорт
	Парам = Новый Массив();  
	Парам.Добавить(АдресХранилищаРезультата); 
	Парам.Добавить(НомерРевизии); 
	Парам.Добавить(ЭтотОбъект.ПутьКХранилищу); 
	Парам.Добавить(ЭтотОбъект.ПользовательХранилища); 
	Парам.Добавить(ЭтотОбъект.ВременныйПользовательХранилища); 
	Парам.Добавить(ЭтотОбъект.ПарольХранилища); 
	Парам.Добавить(СохранитьНастройкиОбъединенияКонфигурации()); 
	Парам.Добавить(КаталогСохраненияФайлов); 
	Парам.Добавить(ВыгружатьФайлы);
	Парам.Добавить(ВыгружатьЗащищеннуюКонфигурацию);
	Парам.Добавить(ПутьКОбфускатору);
		
	ФЗ = ФоновыеЗадания.Выполнить("БФТ_ДлительныеОперацииСервер.ВыполнитьПроцессПереноса", Парам,, СтрШаблон("Выгрузка ревизии ""%1""", Формат(НомерРевизии, "ЧГ=")));
	Возврат ФЗ;
КонецФункции

#КонецОбласти
	
#Область СлужебныеПроцедурыИФункции

Функция СохранитьНастройкиОбъединенияКонфигурации()
  Тело = ЭтотОбъект.ПолучитьМакет("НастройкиОбъединенияКонфигурации").ПолучитьТекст();
  
  ФайлНастроек = ПолучитьИмяВременногоФайла("xml");
  ЗаписьТекста = Новый ЗаписьТекста(ФайлНастроек, КодировкаТекста.UTF8);
  ЗаписьТекста.Записать(Тело);
  ЗаписьТекста.Закрыть();
  
  Возврат ФайлНастроек;
КонецФункции

#КонецОбласти
